#
# .zsh_plugins.txt - antidote plugins file
#

# Load near the top so you get p10k's instaprompt if you need it.
zshzoo/prompt
#mattmc3/zephyr path:plugins/prompt

mattmc3/zephyr path:plugins/zfunctions

# Zephyr
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/macos conditional:is-macos

# Clipboard
# ohmyzsh/ohmyzsh path:lib/clipboard.zsh
# ohmyzsh/ohmyzsh path:plugins/copyfile
# ohmyzsh/ohmyzsh path:plugins/copybuffer
# ohmyzsh/ohmyzsh path:plugins/copypath

# Custom
$ZSH_CUSTOM path:plugins/abbreviations
$ZSH_CUSTOM path:plugins/git
$ZSH_CUSTOM path:plugins/gpg
$ZSH_CUSTOM path:plugins/iwd
$ZSH_CUSTOM path:plugins/golang
$ZSH_CUSTOM path:plugins/otp
$ZSH_CUSTOM path:plugins/python

# Custom 2
nix-community/nix-zsh-completions
ogham/exa kind:fpath
hlissner/zsh-autopair
fdellwing/zsh-bat
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gitfast
# tj/git-extras
# ohmyzsh/ohmyzsh path:plugins/git-extras
wfxr/forgit

# Utils
romkatv/zsh-bench kind:path
ohmyzsh/ohmyzsh path:plugins/extract

# Editor
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z

# Completion
mattmc3/zephyr path:plugins/completion kind:defer
aloxaf/fzf-tab kind:defer
freed-wu/fzf-tab-source kind:defer

# custom
mattmc3/zsh_custom path:plugins/python

# regular plugins
mattmc3/zman
ajeetdsouza/zoxide
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

# vi: ft=config
