tap "aws/tap"
tap "candid82/brew"
tap "dbt-labs/dbt"
tap "dotenv-org/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "yqrashawn/goku"
brew "xz"
brew "ca-certificates"
brew "openssl@1.1"
brew "readline"
brew "libyaml"
brew "pygments"
brew "aws-sam-cli"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "bison"
brew "node"
brew "bitwarden-cli"
brew "libksba"
brew "gnupg"
brew "blackbox"
brew "btop"
brew "python@3.9"
brew "cabal-install"
brew "cfn-lint"
brew "harfbuzz"
brew "chafa"
brew "coreutils"
brew "libssh2"
brew "dhall"
brew "dhall-bash"
brew "dhall-json"
brew "dhall-lsp-server"
brew "diff-so-fancy"
brew "exa"
brew "ghostscript"
brew "imagemagick"
brew "folderify"
brew "fzf"
brew "forgit"
brew "freetds"
brew "gawk"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-flow"
brew "git-gui"
brew "git-lfs"
brew "gnu-sed"
brew "netpbm"
brew "graphviz"
brew "pkg-config"
brew "helix"
brew "howdoi"
brew "keychain"
brew "krb5"
brew "lazydocker"
brew "lesspipe"
brew "libpq"
brew "makeself"
brew "mariadb-connector-c"
brew "navi"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "openjdk@17"
brew "organize-tool"
brew "php", restart_service: true
brew "pillow"
brew "pinentry-mac"
brew "pipx"
brew "postgresql@14"
brew "psgrep"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.8"
brew "qemu"
brew "ripgrep"
brew "rlwrap"
brew "rust"
brew "sdl2"
brew "sevenzip"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tmate"
brew "tmux"
brew "vim"
brew "wget"
brew "xxh"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "dotenv-org/brew/dotenv-vault"
brew "yqrashawn/goku/goku"
cask "background-music"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "hiddenbar"
cask "iterm2"
cask "ngrok"
cask "qmk-toolbox"
cask "snowflake-snowsql"
